In [1]:
import os
path="D:/project folder/first_project/data/aggregated/insurance/country/india/state/"
Agg_state_list=os.listdir(path)
Agg_state_list

['andaman-&-nicobar-islands',
 'andhra-pradesh',
 'arunachal-pradesh',
 'assam',
 'bihar',
 'chandigarh',
 'chhattisgarh',
 'dadra-&-nagar-haveli-&-daman-&-diu',
 'delhi',
 'goa',
 'gujarat',
 'haryana',
 'himachal-pradesh',
 'jammu-&-kashmir',
 'jharkhand',
 'karnataka',
 'kerala',
 'ladakh',
 'lakshadweep',
 'madhya-pradesh',
 'maharashtra',
 'manipur',
 'meghalaya',
 'mizoram',
 'nagaland',
 'odisha',
 'puducherry',
 'punjab',
 'rajasthan',
 'sikkim',
 'tamil-nadu',
 'telangana',
 'tripura',
 'uttar-pradesh',
 'uttarakhand',
 'west-bengal']

In [2]:
#Once created the clone of GIT-HUB repository then,
#Required libraries for the program

import pandas as pd
import json
import os

##for Aggregate

In [3]:
#This is to direct the path to get the data as states

path="D:/project folder/first_project/data/aggregated/insurance/country/india/state/"
Agg_state_list=os.listdir(path)
Agg_state_list

['andaman-&-nicobar-islands',
 'andhra-pradesh',
 'arunachal-pradesh',
 'assam',
 'bihar',
 'chandigarh',
 'chhattisgarh',
 'dadra-&-nagar-haveli-&-daman-&-diu',
 'delhi',
 'goa',
 'gujarat',
 'haryana',
 'himachal-pradesh',
 'jammu-&-kashmir',
 'jharkhand',
 'karnataka',
 'kerala',
 'ladakh',
 'lakshadweep',
 'madhya-pradesh',
 'maharashtra',
 'manipur',
 'meghalaya',
 'mizoram',
 'nagaland',
 'odisha',
 'puducherry',
 'punjab',
 'rajasthan',
 'sikkim',
 'tamil-nadu',
 'telangana',
 'tripura',
 'uttar-pradesh',
 'uttarakhand',
 'west-bengal']

In [4]:
#This is to extract the data's to create a dataframe

clm={'State':[], 'Year':[],'Quater':[],'Transacion_type':[], 'Transacion_count':[], 'Transacion_amount':[]}

for i in Agg_state_list:
    p_i=path+i+"/"
    Agg_yr=os.listdir(p_i)
    for j in Agg_yr:
        p_j=p_i+j+"/"
        Agg_yr_list=os.listdir(p_j)
        for k in Agg_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            D=json.load(Data)
            for z in D['data']['transactionData']:
              Name=z['name']
              count=z['paymentInstruments'][0]['count']
              amount=z['paymentInstruments'][0]['amount']
              clm['Transacion_type'].append(Name)
              clm['Transacion_count'].append(count)
              clm['Transacion_amount'].append(amount)
              clm['State'].append(i)
              clm['Year'].append(j)
              clm['Quater'].append(int(k.strip('.json')))
#Succesfully created a dataframe
Agg_Insur=pd.DataFrame(clm)

In [5]:
Agg_Insur

,State,Year,Quater,Transacion_type,Transacion_count,Transacion_amount
0,andaman-&-nicobar-islands,2020,2,Insurance,6,1360.0
1,andaman-&-nicobar-islands,2020,3,Insurance,41,15380.0
2,andaman-&-nicobar-islands,2020,4,Insurance,124,157975.0
3,andaman-&-nicobar-islands,2021,1,Insurance,225,244266.0
4,andaman-&-nicobar-islands,2021,2,Insurance,137,181504.0
...,...,...,...,...,...,...
677,west-bengal,2023,4,Insurance,72712,100365562.0
678,west-bengal,2024,1,Insurance,79576,104987909.0
679,west-bengal,2024,2,Insurance,67048,89476633.0
680,west-bengal,2024,3,Insurance,77158,107451766.0
681,west-bengal,2024,4,Insurance,91719,120602777.0

In [21]:
path="D:/project folder/first_project/data/aggregated/transaction/country/india/state/"
Agg_state_list=os.listdir(path)

clm={'State':[], 'Year':[],'Quater':[],'Transacion_type':[], 'Transacion_count':[], 'Transacion_amount':[]}

for i in Agg_state_list:
    p_i=path+i+"/"
    Agg_yr=os.listdir(p_i)
    for j in Agg_yr:
        p_j=p_i+j+"/"
        Agg_yr_list=os.listdir(p_j)
        for k in Agg_yr_list:
            p_k=p_j+k
            Data=open(p_k,'r')
            D=json.load(Data)
            for z in D['data']['transactionData']:
              Name=z['name']
              count=z['paymentInstruments'][0]['count']
              amount=z['paymentInstruments'][0]['amount']
              clm['Transacion_type'].append(Name)
              clm['Transacion_count'].append(count)
              clm['Transacion_amount'].append(amount)
              clm['State'].append(i)
              clm['Year'].append(j)
              clm['Quater'].append(int(k.strip('.json')))
#Succesfully created a dataframe
Agg_Trans=pd.DataFrame(clm)

In [22]:
Agg_Trans

,State,Year,Quater,Transacion_type,Transacion_count,Transacion_amount
0,andaman-&-nicobar-islands,2018,1,Recharge & bill payments,4200,1.845307e+06
1,andaman-&-nicobar-islands,2018,1,Peer-to-peer payments,1871,1.213866e+07
2,andaman-&-nicobar-islands,2018,1,Merchant payments,298,4.525072e+05
3,andaman-&-nicobar-islands,2018,1,Financial Services,33,1.060142e+04
4,andaman-&-nicobar-islands,2018,1,Others,256,1.846899e+05
...,...,...,...,...,...,...
5029,west-bengal,2024,4,Merchant payments,655100809,3.892862e+11
5030,west-bengal,2024,4,Peer-to-peer payments,493217788,1.361927e+12
5031,west-bengal,2024,4,Recharge & bill payments,76043195,5.753406e+10
5032,west-bengal,2024,4,Financial Services,2352084,8.472965e+08
5033,west-bengal,2024,4,Others,421806,5.053641e+08

In [26]:
path="D:/project folder/first_project/data/aggregated/user/country/india/state/"
Agg_state_list=os.listdir(path)

clm = {
    'State': [],
    'Year': [],
    'Quarter': [],
    'Brand': [],
    'User_count': [],
    'Percentage': []
}

for i in Agg_state_list:
    p_i = path + i + "/"
    Agg_yr = os.listdir(p_i)

    for j in Agg_yr:
        p_j = p_i + j + "/"
        Agg_qtr_list = os.listdir(p_j)

        for k in Agg_qtr_list:
            p_k = p_j + k
            with open(p_k, 'r') as Data:
                D = json.load(Data)

            users_device = D.get('data', {}).get('usersByDevice')
            if users_device is None:
                continue

            quarter = int(k.replace('.json', ''))  # ✅ FIX

            for z in users_device:
                clm['Brand'].append(z['brand'])
                clm['User_count'].append(z['count'])
                clm['Percentage'].append(z['percentage'])
                clm['State'].append(i)
                clm['Year'].append(j)
                clm['Quarter'].append(quarter)

Agg_User = pd.DataFrame(clm)

In [31]:
Agg_User

,State,Year,Quarter,Brand,User_count,Percentage
0,andaman-&-nicobar-islands,2018,1,Xiaomi,1665,0.247033
1,andaman-&-nicobar-islands,2018,1,Samsung,1445,0.214392
2,andaman-&-nicobar-islands,2018,1,Vivo,982,0.145697
3,andaman-&-nicobar-islands,2018,1,Oppo,501,0.074332
4,andaman-&-nicobar-islands,2018,1,OnePlus,332,0.049258
...,...,...,...,...,...,...
6727,west-bengal,2022,1,Lenovo,330017,0.015056
6728,west-bengal,2022,1,Infinix,284678,0.012987
6729,west-bengal,2022,1,Asus,280347,0.012790
6730,west-bengal,2022,1,Apple,277752,0.012671
6731,west-bengal,2022,1,Others,2196334,0.100199

##for map

In [38]:
path="D:/project folder/first_project/data/map/insurance/hover/country/india/state/"
map_state_list=os.listdir(path)

clm = {
    'State': [],
    'Year': [],
    'Quarter': [],
    'District': [],
    'Transaction_type': [],
    'Transaction_count': [],
    'Transaction_amount': []
}

for i in map_state_list:
    p_i = path + i + "/"
    map_yr = os.listdir(p_i)

    for j in map_yr:
        p_j = p_i + j + "/"
        map_qtr_list = os.listdir(p_j)

        for k in map_qtr_list:
            p_k = p_j + k
            with open(p_k, 'r') as Data:
                D = json.load(Data)

            hover_list = D.get('data', {}).get('hoverDataList')
            if hover_list is None:
                continue

            quarter = int(k.replace('.json', ''))  # ✅ FIX

            for z in hover_list:
                district = z['name']

                for m in z['metric']:
                    clm['State'].append(i)
                    clm['Year'].append(j)
                    clm['Quarter'].append(quarter)
                    clm['District'].append(district)
                    clm['Transaction_type'].append(m['type'])
                    clm['Transaction_count'].append(m['count'])
                    clm['Transaction_amount'].append(m['amount'])

# Create DataFrame
map_Insur = pd.DataFrame(clm)

In [39]:
map_Insur

,State,Year,Quarter,District,Transaction_type,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2020,2,south andaman district,TOTAL,3,795.0
1,andaman-&-nicobar-islands,2020,2,nicobars district,TOTAL,3,565.0
2,andaman-&-nicobar-islands,2020,3,north and middle andaman district,TOTAL,1,281.0
3,andaman-&-nicobar-islands,2020,3,south andaman district,TOTAL,35,13651.0
4,andaman-&-nicobar-islands,2020,3,nicobars district,TOTAL,5,1448.0
...,...,...,...,...,...,...,...
13871,west-bengal,2024,4,alipurduar district,TOTAL,1023,1613143.0
13872,west-bengal,2024,4,paschim bardhaman district,TOTAL,4945,7005851.0
13873,west-bengal,2024,4,nadia district,TOTAL,3807,5031294.0
13874,west-bengal,2024,4,birbhum district,TOTAL,1818,2423290.0
13875,west-bengal,2024,4,purba medinipur district,TOTAL,3559,4439061.0

In [49]:
path="D:/project folder/first_project/data/map/transaction/hover/country/india/state/"
map_state_list=os.listdir(path)

clm = {
    'State': [],
    'Year': [],
    'Quarter': [],
    'District': [],
    'Transaction_type': [],
    'Transaction_count': [],
    'Transaction_amount': []
}

for i in map_state_list:
    p_i = path + i + "/"
    map_yr = os.listdir(p_i)

    for j in map_yr:
        p_j = p_i + j + "/"
        map_qtr_list = os.listdir(p_j)

        for k in map_qtr_list:
            p_k = p_j + k
            with open(p_k, 'r') as Data:
                D = json.load(Data)

            hover_list = D.get('data', {}).get('hoverDataList')
            if hover_list is None:
                continue

            quarter = int(k.replace('.json', ''))  # ✅ FIX

            for z in hover_list:
                district = z['name']

                for m in z['metric']:
                    clm['State'].append(i)
                    clm['Year'].append(j)
                    clm['Quarter'].append(quarter)
                    clm['District'].append(district)
                    clm['Transaction_type'].append(m['type'])
                    clm['Transaction_count'].append(m['count'])
                    clm['Transaction_amount'].append(m['amount'])

# Create DataFrame
map_trans = pd.DataFrame(clm)

In [50]:
map_trans

,State,Year,Quarter,District,Transaction_type,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,north and middle andaman district,TOTAL,442,9.316631e+05
1,andaman-&-nicobar-islands,2018,1,south andaman district,TOTAL,5688,1.256025e+07
2,andaman-&-nicobar-islands,2018,1,nicobars district,TOTAL,528,1.139849e+06
3,andaman-&-nicobar-islands,2018,2,north and middle andaman district,TOTAL,825,1.317863e+06
4,andaman-&-nicobar-islands,2018,2,south andaman district,TOTAL,9395,2.394824e+07
...,...,...,...,...,...,...,...
20599,west-bengal,2024,4,alipurduar district,TOTAL,15875637,2.099251e+10
20600,west-bengal,2024,4,paschim bardhaman district,TOTAL,56616799,6.968735e+10
20601,west-bengal,2024,4,nadia district,TOTAL,65274337,1.079320e+11
20602,west-bengal,2024,4,birbhum district,TOTAL,36905213,5.778701e+10
20603,west-bengal,2024,4,purba medinipur district,TOTAL,67833775,1.142771e+11

In [63]:
path="D:/project folder/first_project/data/map/user/hover/country/india/state/"
map_state_list=os.listdir(path)

clm = {
    'State': [],
    'Year': [],
    'Quarter': [],
    'District': [],
    'Registered_users': [],
    'App_opens': []
}

for i in map_state_list:
    p_i = path + i + "/"
    map_yr = os.listdir(p_i)

    for j in map_yr:
        p_j = p_i + j + "/"
        map_qtr_list = os.listdir(p_j)

        for k in map_qtr_list:
            p_k = p_j + k
            with open(p_k, 'r') as Data:
                D = json.load(Data)

            hover_data = D.get('data', {}).get('hoverData')
            if hover_data is None:
                continue

            quarter = int(k.replace('.json', ''))  # correct quarter extraction

            # hoverData is a DICTIONARY
            for district, values in hover_data.items():
                clm['State'].append(i)
                clm['Year'].append(j)
                clm['Quarter'].append(quarter)
                clm['District'].append(district)
                clm['Registered_users'].append(values['registeredUsers'])
                clm['App_opens'].append(values['appOpens'])

# Create DataFrame
map_users = pd.DataFrame(clm)

In [64]:
map_users

,State,Year,Quarter,District,Registered_users,App_opens
0,andaman-&-nicobar-islands,2018,1,north and middle andaman district,632,0
1,andaman-&-nicobar-islands,2018,1,south andaman district,5846,0
2,andaman-&-nicobar-islands,2018,1,nicobars district,262,0
3,andaman-&-nicobar-islands,2018,2,north and middle andaman district,911,0
4,andaman-&-nicobar-islands,2018,2,south andaman district,8143,0
...,...,...,...,...,...,...
20603,west-bengal,2024,4,alipurduar district,475688,31842355
20604,west-bengal,2024,4,paschim bardhaman district,1468252,80543469
20605,west-bengal,2024,4,nadia district,1861738,98740305
20606,west-bengal,2024,4,birbhum district,1114220,73465525
20607,west-bengal,2024,4,purba medinipur district,1717074,108350777

##for top

In [68]:
path="D:/project folder/first_project/data/top/insurance/country/india/state/"
top_state_list=os.listdir(path)

clm = {
    'State': [],
    'Year': [],
    'Quarter': [],
    'Transaction_type': [],
    'Transaction_count': [],
    'Transaction_amount': []
}

for i in top_state_list:
    p_i = path + i + "/"
    top_yr = os.listdir(p_i)

    for j in top_yr:
        p_j = p_i + j + "/"
        top_qtr_list = os.listdir(p_j)

        for k in top_qtr_list:
            p_k = p_j + k
            with open(p_k, 'r') as Data:
                D = json.load(Data)

            data = D.get('data', {})
            quarter = int(k.replace('.json', ''))

            # Loop through states, districts, pincodes
            for level in ['states', 'districts', 'pincodes']:
                entity_list = data.get(level)
                if entity_list is None:
                    continue

                for item in entity_list:
                    metric = item['metric']

                    clm['State'].append(i)
                    clm['Year'].append(j)
                    clm['Quarter'].append(quarter)
                    clm['Transaction_type'].append(metric['type'])
                    clm['Transaction_count'].append(metric['count'])
                    clm['Transaction_amount'].append(metric['amount'])

# Create DataFrame
top_insurance = pd.DataFrame(clm)

In [69]:
top_insurance

,State,Year,Quarter,Transaction_type,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2020,2,TOTAL,3,565.0
1,andaman-&-nicobar-islands,2020,2,TOTAL,3,795.0
2,andaman-&-nicobar-islands,2020,2,TOTAL,3,565.0
3,andaman-&-nicobar-islands,2020,2,TOTAL,2,513.0
4,andaman-&-nicobar-islands,2020,2,TOTAL,1,282.0
...,...,...,...,...,...,...
12271,west-bengal,2024,4,TOTAL,713,750354.0
12272,west-bengal,2024,4,TOTAL,642,969634.0
12273,west-bengal,2024,4,TOTAL,627,761501.0
12274,west-bengal,2024,4,TOTAL,619,787836.0
12275,west-bengal,2024,4,TOTAL,574,888613.0

In [77]:
path="D:/project folder/first_project/data/top/transaction/country/india/state/"
top_state_list=os.listdir(path)

clm = {
    'State': [],
    'Year': [],
    'Quarter': [],
    'Transaction_type': [],
    'Transaction_count': [],
    'Transaction_amount': []
}

for i in top_state_list:
    p_i = path + i + "/"
    top_yr = os.listdir(p_i)

    for j in top_yr:
        p_j = p_i + j + "/"
        top_qtr_list = os.listdir(p_j)

        for k in top_qtr_list:
            p_k = p_j + k
            with open(p_k, 'r') as Data:
                D = json.load(Data)

            data = D.get('data', {})
            quarter = int(k.replace('.json', ''))

            # Loop through states, districts, pincodes
            for level in ['states', 'districts', 'pincodes']:
                entity_list = data.get(level)
                if entity_list is None:
                    continue

                for item in entity_list:
                    metric = item['metric']

                    clm['State'].append(i)
                    clm['Year'].append(j)
                    clm['Quarter'].append(quarter)
                    clm['Transaction_type'].append(metric['type'])
                    clm['Transaction_count'].append(metric['count'])
                    clm['Transaction_amount'].append(metric['amount'])

# Create DataFrame
top_Transaction = pd.DataFrame(clm)

In [78]:
top_Transaction

,State,Year,Quarter,Transaction_type,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,TOTAL,5688,1.256025e+07
1,andaman-&-nicobar-islands,2018,1,TOTAL,528,1.139849e+06
2,andaman-&-nicobar-islands,2018,1,TOTAL,442,9.316631e+05
3,andaman-&-nicobar-islands,2018,1,TOTAL,1622,2.769298e+06
4,andaman-&-nicobar-islands,2018,1,TOTAL,1223,2.238042e+06
...,...,...,...,...,...,...
18290,west-bengal,2024,4,TOTAL,6753348,1.049483e+10
18291,west-bengal,2024,4,TOTAL,6662715,8.009476e+09
18292,west-bengal,2024,4,TOTAL,6575693,9.018748e+09
18293,west-bengal,2024,4,TOTAL,6432082,8.996529e+09
18294,west-bengal,2024,4,TOTAL,6313560,1.050259e+10

In [84]:
path="D:/project folder/first_project/data/top/user/country/india/state/"
top_state_list=os.listdir(path)

clm = {
    'State': [],
    'Year': [],
    'Quarter': [],
    'Registered_users': []
}

for i in top_state_list:
    p_i = path + i + "/"
    top_yr = os.listdir(p_i)

    for j in top_yr:
        p_j = p_i + j + "/"
        top_qtr_list = os.listdir(p_j)

        for k in top_qtr_list:
            p_k = p_j + k
            with open(p_k, 'r') as Data:
                D = json.load(Data)

            data = D.get('data', {})
            quarter = int(k.replace('.json', ''))

            # Loop through states, districts, pincodes
            for level in ['states', 'districts', 'pincodes']:
                entity_list = data.get(level)
                if entity_list is None:
                    continue

                for item in entity_list:
                    clm['State'].append(i)
                    clm['Year'].append(j)
                    clm['Quarter'].append(quarter)
                    clm['Registered_users'].append(item['registeredUsers'])

# Create DataFrame
top_users = pd.DataFrame(clm)

In [85]:
top_users

                           State  Year  Quarter  Registered_users
0      andaman-&-nicobar-islands  2018        1              5846
1      andaman-&-nicobar-islands  2018        1               632
2      andaman-&-nicobar-islands  2018        1               262
3      andaman-&-nicobar-islands  2018        1              1608
4      andaman-&-nicobar-islands  2018        1              1108
...                          ...   ...      ...               ...
18291                west-bengal  2024        4            169596
18292                west-bengal  2024        4            169448
18293                west-bengal  2024        4            146034
18294                west-bengal  2024        4            142151
18295                west-bengal  2024        4            142077

[18296 rows x 4 columns]

In [22]:
! pip install pymysql

Requirement already satisfied: pymysql in c:\users\vinay mishra\appdata\local\programs\python\python310\lib\site-packages (1.1.2)

WARNING: You are using pip version 21.2.3; however, version 25.3 is available.
You should consider upgrading via the 'C:\Users\Vinay Mishra\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [6]:
import pymysql

# Connect to MySQL
mydb = pymysql.connect(
    host="localhost",
    user="root",      
    password="Vinay@123"
)

print("Connected to MySQL!")

Connected to MySQL!

In [ ]:
cursor = mydb.cursor()

cursor.execute("CREATE DATABASE phonepe")

print("Database created!")

Database created!

In [91]:
mydb = pymysql.connect(
    host="localhost",
    user="root",
    password="Vinay@123",
    database="phonepe",
    connect_timeout=600
)

cursor = mydb.cursor()

In [9]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Aggregated_insurance (
    State VARCHAR(100),
    Year INT,
    Quarter TINYINT,
    Transaction_type VARCHAR(100),
    Transaction_count BIGINT,
    Transaction_amount DECIMAL(15,2)
)
"""

cursor.execute(create_table_query)
mydb.commit()

print("Table created successfully!")

cursor.close()
mydb.close()

Table created successfully!

In [14]:
cursor = mydb.cursor()

sql = """
INSERT INTO Aggregated_insurance
(State, Year, Quarter, Transaction_type, Transaction_count, Transaction_amount)
VALUES (%s, %s, %s, %s, %s, %s)
"""

for index, row in Agg_Insur.iterrows():
    values = (
        row['State'],
        int(row['Year']),
        int(row['Quater']),
        row['Transacion_type'],
        int(row['Transacion_count']),
        float(row['Transacion_amount'])
    )
    cursor.execute(sql, values)

mydb.commit()

cursor.close()
mydb.close()

print("All data inserted successfully!")

All data inserted successfully!

In [19]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Aggregated_transaction (
    State VARCHAR(100),
    Year INT,
    Quarter TINYINT,
    Transaction_type VARCHAR(100),
    Transaction_count BIGINT,
    Transaction_amount DECIMAL(15,2)
)
"""

cursor.execute(create_table_query)
mydb.commit()

print("Table created successfully!")

cursor.close()
mydb.close()

Table created successfully!

In [25]:
cursor = mydb.cursor()

sql = """
INSERT INTO Aggregated_transaction
(State, Year, Quarter, Transaction_type, Transaction_count, Transaction_amount)
VALUES (%s, %s, %s, %s, %s, %s)
"""

for index, row in Agg_Trans.iterrows():
    values = (
        row['State'],
        int(row['Year']),
        int(row['Quater']),
        row['Transacion_type'],
        int(row['Transacion_count']),
        float(row['Transacion_amount'])
    )
    cursor.execute(sql, values)

mydb.commit()

cursor.close()
mydb.close()

print("All data inserted successfully!")

All data inserted successfully!

In [29]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Aggregated_user (
    State VARCHAR(100),
    Year INT,
    Quarter TINYINT,
    Brand VARCHAR(100),
    User_count BIGINT,
    Percentage DECIMAL(15,8)
)
"""

cursor.execute(create_table_query)
mydb.commit()

print("Table created successfully!")

cursor.close()
mydb.close()

Table created successfully!

In [37]:
cursor = mydb.cursor()

sql = """
INSERT INTO Aggregated_user
(State, Year, Quarter, Brand, User_count, Percentage)
VALUES (%s, %s, %s, %s, %s, %s)
"""

for index, row in Agg_User.iterrows():
    values = (
        row['State'],
        int(row['Year']),
        int(row['Quarter']),
        row['Brand'],
        int(row['User_count']),
        float(row['Percentage'])
    )
    cursor.execute(sql, values)

mydb.commit()

cursor.close()
mydb.close()

print("All data inserted successfully!")

All data inserted successfully!

In [41]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Map_insurance (
    State VARCHAR(100),
    Year INT,
    Quarter TINYINT,
    District VARCHAR(100),
    Transaction_type VARCHAR(100),
    Transaction_count BIGINT,
    Transaction_amount DECIMAL(15,2)
)
"""

cursor.execute(create_table_query)
mydb.commit()

print("Table created successfully!")

cursor.close()
mydb.close()

Table created successfully!

In [48]:
cursor = mydb.cursor()

sql = """
INSERT INTO Map_insurance
(State, Year, Quarter, District, Transaction_type, Transaction_count, Transaction_amount)
VALUES (%s, %s, %s, %s, %s, %s, %s)
"""

for index, row in map_Insur.iterrows():
    values = (
        row['State'],
        int(row['Year']),
        int(row['Quarter']),
        row['District'],
        row['Transaction_type'],
        int(row['Transaction_count']),
        float(row['Transaction_amount'])
    )
    cursor.execute(sql, values)

mydb.commit()

cursor.close()
mydb.close()

print("All data inserted successfully!")

All data inserted successfully!

In [53]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Map_transaction (
    State VARCHAR(100),
    Year INT,
    Quarter TINYINT,
    District VARCHAR(100),
    Transaction_type VARCHAR(100),
    Transaction_count BIGINT,
    Transaction_amount DECIMAL(15,2)
)
"""

cursor.execute(create_table_query)
mydb.commit()

print("Table created successfully!")

cursor.close()
mydb.close()

Table created successfully!

In [56]:
cursor = mydb.cursor()

sql = """
INSERT INTO Map_transaction
(State, Year, Quarter, District, Transaction_type, Transaction_count, Transaction_amount)
VALUES (%s, %s, %s, %s, %s, %s, %s)
"""

for index, row in map_trans.iterrows():
    values = (
        row['State'],
        int(row['Year']),
        int(row['Quarter']),
        row['District'],
        row['Transaction_type'],
        int(row['Transaction_count']),
        float(row['Transaction_amount'])
    )
    cursor.execute(sql, values)

mydb.commit()

cursor.close()
mydb.close()

print("All data inserted successfully!")

All data inserted successfully!

In [59]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Map_user (
    State VARCHAR(100),
    Year INT,
    Quarter TINYINT,
    District VARCHAR(100),
    Registered_users INT,
    App_opens BIGINT
)
"""

cursor.execute(create_table_query)
mydb.commit()

print("Table created successfully!")

cursor.close()
mydb.close()

Table created successfully!

In [67]:
cursor = mydb.cursor()

sql = """
INSERT INTO Map_user
(State, Year, Quarter, District, Registered_users, App_opens)
VALUES (%s, %s, %s, %s, %s, %s)
"""

for index, row in map_users.iterrows():
    values = (
        row['State'],
        int(row['Year']),
        int(row['Quarter']),
        row['District'],
        int(row['Registered_users']),
        int(row['App_opens'])
    )
    cursor.execute(sql, values)

mydb.commit()

cursor.close()
mydb.close()

print("All data inserted successfully!")

All data inserted successfully!

In [71]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Top_insurance (
    State VARCHAR(100),
    Year INT,
    Quarter TINYINT,
    Transaction_type VARCHAR(100),
    Transaction_count BIGINT,
    Transaction_amount DECIMAL(15,2)
)
"""

cursor.execute(create_table_query)
mydb.commit()

print("Table created successfully!")

cursor.close()
mydb.close()

Table created successfully!

In [76]:
cursor = mydb.cursor()

sql = """
INSERT INTO Top_insurance
(State, Year, Quarter, Transaction_type, Transaction_count, Transaction_amount)
VALUES (%s, %s, %s, %s, %s, %s)
"""

for index, row in top_insurance.iterrows():
    values = (
        row['State'],
        int(row['Year']),
        int(row['Quarter']),
        row['Transaction_type'],
        int(row['Transaction_count']),
        float(row['Transaction_amount'])
    )
    cursor.execute(sql, values)

mydb.commit()

cursor.close()
mydb.close()

print("All data inserted successfully!")

All data inserted successfully!

In [80]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Top_transaction (
    State VARCHAR(100),
    Year INT,
    Quarter TINYINT,
    Transaction_type VARCHAR(100),
    Transaction_count BIGINT,
    Transaction_amount DECIMAL(15,2)
)
"""

cursor.execute(create_table_query)
mydb.commit()

print("Table created successfully!")

cursor.close()
mydb.close()

Table created successfully!

In [83]:
cursor = mydb.cursor()

sql = """
INSERT INTO Top_transaction
(State, Year, Quarter, Transaction_type, Transaction_count, Transaction_amount)
VALUES (%s, %s, %s, %s, %s, %s)
"""

for index, row in top_Transaction.iterrows():
    values = (
        row['State'],
        int(row['Year']),
        int(row['Quarter']),
        row['Transaction_type'],
        int(row['Transaction_count']),
        float(row['Transaction_amount'])
    )
    cursor.execute(sql, values)

mydb.commit()

cursor.close()
mydb.close()

print("All data inserted successfully!")

All data inserted successfully!

In [88]:
create_table_query = """
CREATE TABLE IF NOT EXISTS Top_user (
    State VARCHAR(100),
    Year INT,
    Quarter TINYINT,
    Registered_users INT
)
"""

cursor.execute(create_table_query)
mydb.commit()

print("Table created successfully!")

cursor.close()
mydb.close()

Table created successfully!

In [92]:
cursor = mydb.cursor()

sql = """
INSERT INTO Top_user
(State, Year, Quarter, Registered_users)
VALUES (%s, %s, %s, %s)
"""

for index, row in top_users.iterrows():
    values = (
        row['State'],
        int(row['Year']),
        int(row['Quarter']),
        int(row['Registered_users'])
    )
    cursor.execute(sql, values)

mydb.commit()

cursor.close()
mydb.close()

print("All data inserted successfully!")

All data inserted successfully!